Revit 2024 API
SpatialFieldManager.GetMaximum Method
 Calculates the maximum value for all primitives
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public double GetMaximum(
	int resultIndex,
	bool rawValue
)
Visual Basic
Public Function GetMaximum ( _
	resultIndex As Integer, _
	rawValue As Boolean _
) As Double
Visual C++
public:
double GetMaximum(
	int resultIndex,
	bool rawValue
)
Parameters
resultIndex
Type: System.Int32
 Index of result schema
rawValue
Type: System.Boolean
 If true returned value is NOT multiplied by the current result's units multiplier, otherwise it IS
Return Value
 Resulting maximum value
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  Thrown when current measurement is >= the number of measurements for at least one primitive
See Also
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace